{
  "profile": {
    "name": "Bill Zhang",
    "description": "An MSCS student at USC, blending machine learning with full-stack web development to craft future-ready applications. With a toolkit spanning NextJS, FastAPI, and Google Cloud, I refine my skills through intense hackathons. Explore with me the symphony of code and creativity!",
    "linkedin": "https://www.linkedin.com/in/bill-zhang1",
    "github": "https://github.com/IdkwhatImD0ing/",
    "devpost": "https://devpost.com/IdkwhatImD0ing/"
  },
  "education": [
    {
      "schoolName": "Lynbrook High School",
      "major": "High School Diploma",
      "dates": "2016-2020",
      "logo": "/lynbrook.png"
    },
    {
      "schoolName": "University of California, Santa Cruz",
      "major": "Bachelor of Science in Computer Science",
      "dates": "2020-2023",
      "logo": "/ucsc.png"
    },
    {
      "schoolName": "University of Southern California",
      "major": "Master of Science in Computer Science - Artificial Intelligence",
      "dates": "2023-2025",
      "logo": "/usc.png"
    }
  ],
  "projects": [
    {
      "name": "SlugLoop",
      "description": "SlugLoop is a real-time map app designed to help UC Santa Cruz students navigate campus with ease by providing up-to-date information on the location and routes of loop buses, reducing pressure on the metro buses during peak hours, and providing a seamless user experience. With a simple and attractive interface, SlugLoop offers an incredibly useful service to students that makes transportation around campus more efficient and less stressful.",
      "code": "DlAGp-IjtJM",
      "techStack": [
        "React",
        "ExpressJs",
        "React Router",
        "Material UI",
        "Firebase",
        "Raspberry PI",
        "C"
      ],
      "link": "https://www.slugloop.tech/",
      "github": "https://github.com/IdkwhatImD0ing/SlugLoop"
    },
    {
      "name": "WebWeaver",
      "description": "WebWeaver is an innovative AI-powered website generation tool that revolutionizes the process of designing and editing websites. Utilizing GPT-Vision, a state-of-the-art multimodal language model, the platform allows for the creation of website drafts based on user inputs, streamlining the design process. It features an advanced code editing interface for users with web development experience, coupled with a user-friendly dashboard for easy management of the entire website creation cycle.",
      "code": "V977Ydky1DI",
      "techStack": [
        "NextJS",
        "FastAPI",
        "OpenAI",
        "Axios",
        "Clerk",
        "Google Cloud",
        "Redis"
      ],
      "link": "https://www.slugloop.tech/"
    },
    {
      "name": "Paddy Plant Prognosis",
      "description": "Paddy Plant Prognosis is a revolutionary web app transforming paddy cultivation. Leveraging advanced computer vision, it enables farmers to quickly identify crop diseases through a simple photo upload. Our app promptly analyzes the image, identifies potential diseases, and offers actionable insights. This tool significantly reduces diagnosis time, helps in early disease detection, and aids farmers in preventing crop loss, ultimately enhancing yield and saving resources.",
      "code": "M_xLQeglzgU",
      "techStack": ["Vite", "Flask", "Tensorflow", "TailwindCSS", "Keras"],
      "link": "https://www.paddyplantprognosis.tech/",
      "github": "https://github.com/IdkwhatImD0ing/PaddyPlantPrognosis"
    },
    {
      "name": "Portfolio Website V1",
      "description": "The first version of my porfolio website, like this one, written in NextJS and Material UI. It features react spring for animations unlike this one which uses Framer Motion.",
      "techStack": ["NextJS", "Material UI", "React Spring"],
      "link": "https://v1.billzhang.tech/",
      "github": "https://github.com/IdkwhatImD0ing/PortfolioTemplate"
    },
    {
      "name": "Memgen ",
      "description": "Revolutionize your job search with Memgen, the intelligent web app that crafts tailored cover letters from your experience, in a snap! Summarize your projects, work history, and resume, and let our advanced vector database find the perfect match for any job description. Stand out from the crowd with personalized, data-driven cover letters that showcase your unique strengths.",
      "code": "v5PAwb0BYtw",
      "techStack": [
        "NextJS",
        "Express",
        "TailwindCSS",
        "Material UI",
        "Axios",
        "OpenAI",
        "Auth0",
        "Firebase",
        "Milvus"
      ],
      "link": "https://memgen.art3m1s.me/",
      "github": "https://github.com/IdkwhatImD0ing/MemGen"
    },
    {
      "name": "Assistance ",
      "description": "Assistance is an innovative application that enables users to interact with multiple large language models concurrently, such as Bing Chat, Google Bard, and ChatGPT3.5, offering a more comprehensive and accurate response to queries. The application is designed to allow users to maintain context, switch between models seamlessly, and ask questions to all models, leveraging their unique strengths and making the AI experience more efficient and valuable.",
      "code": "DAuMnWCKtSk",
      "techStack": [
        "Gatsby",
        "FastAPI",
        "Material UI",
        "OpenAI",
        "Google Bard",
        "Bing Chat"
      ],
      "link": "https://assistance.art3m1s.me/",
      "github": "https://github.com/IdkwhatImD0ing/Assistance"
    },
    {
      "name": "Make Me Lunch",
      "description": "MakeMeLunch is an intuitive web-based tool designed for efficient meal planning and grocery shopping. It allows users to compile recipes, from which it generates a tailored shopping list to minimize unnecessary purchases and food waste. Additionally, users can input their current pantry inventory to receive recipe suggestions, optimizing the use of available ingredients. This feature is especially beneficial for cost-saving and reducing excess.",
      "code": "SmRpW295Xkk",
      "techStack": ["React", "Firebase", "RapidApi"],
      "link": "https://makemelunch.xyz/",
      "github": "https://github.com/IdkwhatImD0ing/MakeMeLunch"
    },

    {
      "name": "Sink Or Swim",
      "description": "Sink or Swim is a web application that uses machine learning to predict a user's chances of survival on the Titanic based on their personal information, and generates a personalized story about their experience on the ship, providing a unique and engaging glimpse into one of the most infamous shipwrecks in history. By combining cutting-edge technology with historical events, Sink or Swim offers a thought-provoking and immersive experience that brings the past to life.",
      "code": "4V-2l-Zel5s",
      "techStack": ["NextJs13", "Flask", "Tensorflow", "TailwindCSS", "Keras"],
      "link": "https://sos.art3m1s.me/",
      "github": "https://github.com/simon-quach/sink-or-swim"
    },

    {
      "name": "Pool Party",
      "description": "Pool Party is a versatile web application that simplifies group travel by connecting users with others headed to the same destination. Optimized for mobile and desktop use, it allows travelers to form or join 'pools' as drivers or passengers, facilitating easy coordination and shared travel costs. With Pool Party, arranging rideshares becomes straightforward, enabling users to select companions based on mutual travel plans, thereby enhancing the journey experience and offering a cost-effective way to travel.",
      "code": "UEInrwiA_r8",
      "techStack": ["React", "ExpressJs", "Hop.io"],
      "link": "https://mypoolparty.tech/",
      "github": "https://github.com/IdkwhatImD0ing/PoolParty"
    },
    {
      "name": "Fiesta",
      "description": "Fiesta is a user-friendly web-based event planning app designed to streamline the organization and registration of events. It addresses common challenges by offering tools for setting dates, locations, and other details, coupled with a straightforward registration process for attendees. This feature aids coordinators in accurately gauging attendance, ensuring efficient planning. Additionally, Fiesta facilitates effortless communication and information sharing, making it a go-to solution for hassle-free event management and enhanced event success.",
      "code": "OjV4-Km9sWw",
      "techStack": [
        "React",
        "ExpressJs",
        "Hop.io",
        "Firebase",
        "Socker.io",
        "Material UI"
      ],
      "link": "https://fiesta.art3m1s.me/",
      "github": "https://github.com/cnRachel/civic-hacks"
    },
    {
      "name": "Eat Safely",
      "description": "Introducing EatSafely, a web app that uses machine learning to help you identify if your food is spoiled or not, thus reducing the risk of foodborne illness and wasting money. With a custom-trained model and an accuracy of 97%, simply upload a photo of the fruit in question, and EatSafely will give you a clear and accurate assessment of whether or not it is safe to eat. Say goodbye to spoiled fruits and hello to EatSafely.",
      "code": "tr3ylJX1h30",
      "techStack": ["React", "Flask", "Hop.io", "Socket.Io", "Tensorflow"],
      "link": "hhttps://eatsafely.art3m1s.me/",
      "github": "https://devpost.com/software/eatsafely"
    },
    {
      "name": "Penmanship Pro",
      "description": "A way to improve handwriting! This webapp is designed to help you improve your handwriting through a series of interactive exercises and challenges. Whether you're a student looking to ace your exams or an adult looking to tidy up your notes, Penmanship has something for everyone. Our ML model rates your writing, helping you to identify and correct any mistakes. With the app's timed exercise, you'll be able to track your progress and see how you stack up against other users. So why wait? Start improving your handwriting today and see the difference it can make!",
      "code": "tf44b12LaDU",
      "techStack": ["React", "Flask", "Hop.io", "Socket.Io", "Tensorflow"],
      "link": "https://kazitasin07.wixsite.com/penmenshipro",
      "github": "https://github.com/Renaud2002/PenmanshipPro-TLE"
    },
    {
      "name": "Remote Trainer",
      "description": "RemoteTrainer is a comprehensive web-based fitness app that personalizes exercise routines to user's specific needs. Users can filter exercises by target muscle groups and available equipment, receiving a curated list of suitable activities complete with instructional GIFs, benefits, and challenges. Additionally, RemoteTrainer offers progress tracking by calculating and monitoring body mass index (BMI) and body fat percentage based on user-provided data. It's an ideal solution for anyone aiming to enhance fitness efficiently and effectively.",
      "code": "vL-X-1XrIN0",
      "techStack": ["React", "Firebase", "RapidApi"],
      "link": "https://remotetrainer.live/",
      "github": "https://github.com/IdkwhatImD0ing/ExerciseTracker"
    },
    {
      "name": "PrognoD",
      "description": "Progno-D is an innovative web-based AI tool designed to assist users in selecting the most suitable medication for their illness. Leveraging customer reviews and ratings, it provides well-informed drug recommendations. Users gain access to a wealth of information including drug details, common manufacturers, and active ingredients, enabling them to understand the potential risks and benefits. Progno-D stands out as a valuable resource for informed medication choices, enhancing users' decision-making process regarding their health.",
      "code": "eqZS5WqHXW4",
      "techStack": ["React", "Flask", "RapidApi", "Hop.io", "NLTK"],
      "link": "https://prognod.art3m1s.me/",
      "github": "https://github.com/RupakKadhare15/Progno-D"
    },
    {
      "name": "Tetris Coop",
      "description": "Tetris Duels is a classic puzzle game that allows players to test their skills and strategy against others. In this game, players can choose to play solo or with family and friends in a competitive multiplayer mode. The goal is to score as many points as possible by strategically placing falling blocks called tetrominoes to form lines without any gaps. As the game progresses, the blocks fall faster and become more difficult to manage, requiring quick thinking and precise movements. With its simple gameplay and endless replay value, Tetris Duels is a fun and addictive game for players of all ages.",
      "code": "y8wPmVJEqlc",
      "techStack": ["React", "ExpressJs", "Hop.io"],
      "link": "https://tetris.art3m1s.me/",
      "github": "https://github.com/IdkwhatImD0ing/tetris-coop"
    },
    {
      "name": "ASL-Transcription",
      "description": "The lens is a useful tool that can be used to transcribe American Sign Language (ASL) in real time. It automatically converts the signed letters into text, allowing the user to easily create written content without the need to manually write captions for every action. In addition to its transcription capabilities, the lens can also be used as a learning tool for ASL. With real-time transcription, the user can practice their speed and accuracy in signing without the need for an interpreter. This can be especially beneficial for those who are learning ASL or for those who are seeking to improve their signing skills.",
      "code": "Nat5vQGsyxA",
      "techStack": ["Javascript", "Python", "Tensorflow", "Keras"],
      "link": "https://lens.snapchat.com/16642dd15be74124ac470c53a82d46fc",
      "github": "https://github.com/IdkwhatImD0ing/ASL-Transcription"
    },
    {
      "name": "Exalt",
      "description": "This project is a Java-based clone of the popular game Realm of the Mad God. In this game, players are placed in an arena and must face an endless series of waves. The objective is to collect potions to increase their stats and to defeat enemies and find loot. Players can also find and equip a variety of weapons and armor to further increase their chances of survival. ",
      "code": "aaFkC9SpMhk",
      "techStack": ["Java"],
      "link": "https://github.com/IdkwhatImD0ing/BulletHellGame/releases/tag/v1.0.1",
      "github": "https://github.com/IdkwhatImD0ing/BulletHellGame"
    }
  ],
  "skills": {
    "languages": [
      ["JavaScript", "100%"],
      ["Python", "95%"],
      ["C/C++", "90%"],
      ["Java", "70%"],
      ["Dart", "60%"],
      ["Haskell", "50%"]
    ],
    "frameworks": [
      ["React", "100%"],
      ["NextJs", "90%"],
      ["FastAPI", "90%"],
      ["Flask", "85%"],
      ["Express.Js", "80%"]
    ],
    "databases": [
      ["Firebase", "100%"],
      ["Redis", "90%"],
      ["Milvus", "80%"],
      ["PostgreSQL", "70%"],
      ["Pinecone", "20%"]
    ],
    "libraries": [
      ["Material UI", "100%"],
      ["Tensorflow", "90%"],
      ["Keras", "80%"],
      ["Pandas", "70%"],
      ["NumPy", "70%"],
      ["Matplotlib", "60%"]
    ]
  },
  "awards": [
    {
      "name": "Best Developer Award",
      "date": "2020-11"
    },
    {
      "name": "Innovative Solution Prize",
      "date": "2019-09"
    }
  ]
}
